nnn112358/pico-faces-M5CoreS3/sdkconfig.defaults
# pico-faces on M5Stack CoreS3（ESP32-S3 / 16 MB flash / 8 MB Quad PSRAM）
#
# 板の設定は nnn112358/SanoTTS-jp-M5StackCoreS3 と sanoTTS-jp の esp32/boards/m5unified/sdkconfig.cores3 に倣った。
CONFIG_IDF_TARGET="esp32s3"

# --- flash（16 MB、QIO 80 MHz）---
# ⚠️ esptool に --flash_mode qio を渡さないこと（ヘッダが QIO になり ROM ローダが読めずブートループ）。
#    @flash_args（dio）のまま焼けば bootloader が起動後に QIO へ切り替える
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM（8 MB Quad。Octal にするとブートループ）---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
# エンジンの大きな .bss（arena 256 KB + DiT の活性 88 KB）を PSRAM に置く（linker.lf）
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# --- コンソール（CoreS3 に USB-UART ブリッジは無い。native USB）---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- 速度 ---
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# --- 内部 DRAM を空ける（D/IRAM は共有プール。IRAM のコードを flash へ）---
# ⚠️ 実行時に flash へ書かない前提の設定（重みは .rodata を読むだけ）
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
CONFIG_SPI_FLASH_ROM_IMPL=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=n

# --- タスク ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
# 1 枚の生成は数十秒かかる。タスク WDT に噛まれないようにする
CONFIG_ESP_TASK_WDT_INIT=n
